STEPS = [
    {
        "step": 1,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [1.5, 1.5, 1.0, 1.0, 3.0],
    },
    {
        "step": 2,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [2.0, 2.0, 1.0, 1.0, 3.0],
    },
    {
        "step": 3,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [3.0, 3.0, 1.5, 1.5, 5.0],
    },
    {
        "step": 4,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [5.0, 5.0, 2.5, 2.5, 5.0],
    },
    {
        "step": 5,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [7.0, 7.0, 3.0, 3.0, 7.0],
    },
    {
        "step": 6,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [9.0, 9.0, 5.0, 5.0, 10.0],
    },
    {
        "step": 7,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [10.0, 10.0, 7.0, 7.0, 10.0],
    },
    {
        "step": 8,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [10.0, 10.0, 10.0, 10.0, 15.0],
    },
    {
        "step": 9,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [10.0, 10.0, 15.0, 15.0, 20.0],
    },
    {
        "step": 10,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [15.0, 15.0, 20.0, 20.0, 25.0],
    },
    {
        "step": 11,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [20.0, 20.0, 25.0, 25.0, 30.0],
    },
    {
        "step": 12,
        "positions": ["Лицом вверх", "На животе", "Левый бок", "Правый бок", "В тени"],
        "duration_min": [30.0, 30.0, 40.0, 40.0, 50.0],
    },
]

