steps = [
    (1, 8), (2, 9), (3, 12), (4, 20),
    (5, 27), (6, 38), (7, 48), (8, 60),
    (9, 85), (10, 110), (11, 150), (12, 190)
]

positions_by_step = {
    1: [("Лицом вверх", 2), ("На животе", 2), ("Левый бок", 1), ("Правый бок", 1), ("В тени", 2)],
    2: [("Лицом вверх", 2), ("На животе", 2), ("Левый бок", 1.5), ("Правый бок", 1.5), ("В тени", 2)],
    3: [("Лицом вверх", 3), ("На животе", 3), ("Левый бок", 2), ("Правый бок", 2), ("В тени", 2)],
    4: [("Лицом вверх", 5), ("На животе", 5), ("Левый бок", 3), ("Правый бок", 3), ("В тени", 4)],
    5: [("Лицом вверх", 7), ("На животе", 7), ("Левый бок", 5), ("Правый бок", 5), ("В тени", 3)],
    6: [("Лицом вверх", 10), ("На животе", 10), ("Левый бок", 6), ("Правый бок", 6), ("В тени", 6)],
    7: [("Лицом вверх", 12), ("На животе", 12), ("Левый бок", 7), ("Правый бок", 7), ("В тени", 10)],
    8: [("Лицом вверх", 15), ("На животе", 15), ("Левый бок", 8), ("Правый бок", 8), ("В тени", 14)],
    9: [("Лицом вверх", 20), ("На животе", 20), ("Левый бок", 12), ("Правый бок", 12), ("В тени", 21)],
    10: [("Лицом вверх", 25), ("На животе", 25), ("Левый бок", 15), ("Правый бок", 15), ("В тени", 30)],
    11: [("Лицом вверх", 30), ("На животе", 30), ("Левый бок", 20), ("Правый бок", 20), ("В тени", 50)],
    12: [("Лицом вверх", 35), ("На животе", 35), ("Левый бок", 25), ("Правый бок", 25), ("В тени", 70)],
}
