
steps_data = [
    {'step': 1, 'positions': ['Лицом вверх — 8 мин', 'На животе — 8 мин', 'В тени — 4 мин'], 'duration_min': 20},
    {'step': 2, 'positions': ['Лицом вверх — 9 мин', 'На животе — 9 мин', 'В тени — 5 мин'], 'duration_min': 23},
    {'step': 3, 'positions': ['Лицом вверх — 10 мин', 'На животе — 10 мин', 'В тени — 6 мин'], 'duration_min': 26},
    {'step': 4, 'positions': ['Лицом вверх — 12 мин', 'На животе — 12 мин', 'В тени — 6 мин'], 'duration_min': 30},
    {'step': 5, 'positions': ['Лицом вверх — 14 мин', 'На животе — 14 мин', 'В тени — 7 мин'], 'duration_min': 35},
    {'step': 6, 'positions': ['Лицом вверх — 16 мин', 'На животе — 16 мин', 'В тени — 8 мин'], 'duration_min': 40},
    {'step': 7, 'positions': ['Лицом вверх — 18 мин', 'На животе — 18 мин', 'В тени — 9 мин'], 'duration_min': 45},
    {'step': 8, 'positions': ['Лицом вверх — 20 мин', 'На животе — 20 мин', 'В тени — 10 мин'], 'duration_min': 50},
    {'step': 9, 'positions': ['Лицом вверх — 25 мин', 'На животе — 25 мин', 'В тени — 10 мин'], 'duration_min': 60},
    {'step': 10, 'positions': ['Лицом вверх — 30 мин', 'На животе — 30 мин', 'В тени — 10 мин'], 'duration_min': 70},
    {'step': 11, 'positions': ['Лицом вверх — 40 мин', 'На животе — 40 мин', 'В тени — 10 мин'], 'duration_min': 90},
    {'step': 12, 'positions': ['Лицом вверх — 60 мин', 'На животе — 60 мин', 'В тени — 30 мин'], 'duration_min': 150},
]
