
steps = [
    {"step": 1, "positions": [("Лицом вверх", 8), ("На животе", 8), ("В тени", 4)]},
    {"step": 2, "positions": [("Лицом вверх", 9), ("На животе", 9), ("В тени", 5)]},
    {"step": 3, "positions": [("Лицом вверх", 10), ("На животе", 10), ("В тени", 6)]},
    {"step": 4, "positions": [("Лицом вверх", 12), ("На животе", 12), ("В тени", 6)]},
    {"step": 5, "positions": [("Лицом вверх", 14), ("На животе", 14), ("В тени", 7)]},
    {"step": 6, "positions": [("Лицом вверх", 16), ("На животе", 16), ("В тени", 8)]},
    {"step": 7, "positions": [("Лицом вверх", 18), ("На животе", 18), ("В тени", 9)]},
    {"step": 8, "positions": [("Лицом вверх", 20), ("На животе", 20), ("В тени", 10)]},
    {"step": 9, "positions": [("Лицом вверх", 25), ("На животе", 25), ("В тени", 10)]},
    {"step": 10, "positions": [("Лицом вверх", 30), ("На животе", 30), ("В тени", 10)]},
    {"step": 11, "positions": [("Лицом вверх", 40), ("На животе", 40), ("В тени", 10)]},
    {"step": 12, "positions": [("Лицом вверх", 60), ("На животе", 60), ("В тени", 30)]},
]
